Revit 2027 API
IFCData.CreateInteger Method
 Creates an integer data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateInteger(
	int value
)
Public Shared Function CreateInteger (
	value As Integer
) As IFCData
public:
static IFCData^ CreateInteger(
	int value
)
static member CreateInteger :
        value : int -> IFCData
Parameters
value Int32
 The integer value.
Return Value
IFCData
 The IFCData object.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace